package park_project;

public class BookingScreen extends Thread {

	String pp[] = {"  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  ","  "};


	public String[] getPp() {
		return pp;
	}

	public void setPp(String[] pp) {
		this.pp = pp;
	}

	public void menu1() {
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println("							$$$$$$$\\                      $$\\       $$\\");                     
		System.out.println("							$$  __$$\\                     $$ |      \\__|");                    
		System.out.println("							$$ |  $$ | $$$$$$\\   $$$$$$\\  $$ |  $$\\ $$\\ $$$$$$$\\   $$$$$$\\");  
		System.out.println("							$$$$$$$\\ |$$  __$$\\ $$  __$$\\ $$ | $$  |$$ |$$  __$$\\ $$  __$$\\"); 
		System.out.println("							$$  __$$\\ $$ /  $$ |$$ /  $$ |$$$$$$  / $$ |$$ |  $$ |$$ /  $$ |");
		System.out.println("							$$ |  $$ |$$ |  $$ |$$ |  $$ |$$  _$$<  $$ |$$ |  $$ |$$ |  $$ |");
		System.out.println("							$$$$$$$  |\\$$$$$$  |\\$$$$$$  |$$ | \\$$\\ $$ |$$ |  $$ |\\$$$$$$$ |");
		System.out.println("							\\_______/  \\______/  \\______/ \\__|  \\__|\\__|\\__|  \\__| \\____$$ |");
		System.out.println("							                                                      $$\\   $$ |");
		System.out.println("							    	                                               \\$$$$$$ |");
		System.out.println("						        	                                                \\_____/"); 
		
		
		
	}
	public void menu2() {
		System.out.println();
		System.out.println("							$$$$$$$\\                                $$\\");
		System.out.println("							$$  __$$\\                               \\__|");                     
		System.out.println("							$$ |  $$ |           $$$$$$\\  $$\\       $$\\            $$$$$$\\");                    
		System.out.println("							$$$$$$$\\            $$  __$$\\ $$ |      $$ |          $$  __$$\\");  
		System.out.println("							$$  __$$\\  $$$$$$\\  $$ /  $$ |$$ |  $$\\ $$ |$$$$$$$\\  $$ /  $$ |"); 
		System.out.println("							$$ |  $$ |$$  __$$\\ $$ |  $$ |$$ | $$  |$$ |$$  __$$\\ $$ |  $$ |");
		System.out.println("							$$$$$$$  |$$ /  $$ |\\$$$$$$  |$$$$$$  / $$ |$$ |  $$ |\\$$$$$$$ |");
		System.out.println("							\\_______/ $$ |  $$ | \\______/ $$  _$$<  \\__|$$ |  $$ | \\____$$ |");
		System.out.println("							          \\$$$$$$  |          $$ | \\$$\\     $$ |  $$ |$$\\   $$ |");
		System.out.println("							           \\______/           \\__|  \\__|    \\__|  \\__| \\$$$$$$ |");
		System.out.println("							                                                        \\_____/");
		System.out.println();
		System.out.println();
		
		
		
	}
	public void menu3() {
		System.out.println();
		System.out.println("							                              $$\\");
		System.out.println("							                              $$ |");
		System.out.println("							$$$$$$$\\   $$$$$$\\            $$ |  $$\\ $$\\ $$$$$$$\\");
		System.out.println("							$$  __$$\\ $$  __$$\\           $$ | $$  |\\__|$$  __$$\\");
		System.out.println("							$$ |  $$ |$$ /  $$ | $$$$$$\\  $$$$$$  / $$\\ $$ |  $$ | $$$$$$\\");
		System.out.println("							$$$$$$$\\  $$ |  $$ |$$  __$$\\ $$  _$$<  $$ |$$ |  $$ |$$  __$$\\");
		System.out.println("							$$  __$$\\ \\$$$$$$  |$$ /  $$ |$$ | \\$$\\ $$ |$$ |  $$ |$$ /  $$ |");
		System.out.println("							$$ |  $$ | \\______/ $$ |  $$ |\\__|  \\__|$$ |\\__|  \\__|$$ |  $$ |");
		System.out.println("							$$$$$$$  |          \\$$$$$$  |          $$ |          \\$$$$$$$ |");
		System.out.println("							\\_______/            \\______/           \\__|           \\____$$ |");
		System.out.println("							                                                      $$\\   $$ |");
		System.out.println("							                                                       \\$$$$$$ |");
		System.out.println("							                                                        \\_____/");
		
		
		
	}
	
	public void menua() {
		System.out.println("");
		System.out.println("");
		System.out.println("");
		System.out.println("							  $$$$$$$\\                      $$\\       $$\\");                     
		System.out.println("							  $$  __$$\\                     $$ |      \\__|");                    
		System.out.println("							  $$ |  $$ | $$$$$$\\   $$$$$$\\  $$ |  $$\\ $$\\ $$$$$$$\\   $$$$$$\\");  
		System.out.println("							  $$$$$$$\\ |$$  __$$\\ $$  __$$\\ $$ | $$  |$$ |$$  __$$\\ $$  __$$\\"); 
		System.out.println("							  $$  __$$\\ $$ /  $$ |$$ /  $$ |$$$$$$  / $$ |$$ |  $$ |$$ /  $$ |");
		System.out.println("							  $$ |  $$ |$$ |  $$ |$$ |  $$ |$$  _$$<  $$ |$$ |  $$ |$$ |  $$ |");
		System.out.println("							  $$$$$$$  |\\$$$$$$  |\\$$$$$$  |$$ | \\$$\\ $$ |$$ |  $$ |\\$$$$$$$ |");
		System.out.println("							  \\_______/  \\______/  \\______/ \\__|  \\__|\\__|\\__|  \\__| \\____$$ |");
		System.out.println("							                                                        $$\\   $$ |");
		System.out.println("							    	                                                 \\$$$$$$ |");
		System.out.println("						        	                                                  \\_____/"); 
		System.out.println("");
		System.out.println("");
		

		System.out.println("									1. ?��?��?���?		2. ?��?��?��?��\n");
		System.out.println("									3. ?��?��?��?��		4. ?�� ?��?��?��?��\n");
		System.out.println("									5. 취소");
		System.out.println("");

		System.out.println(
				"									                                  ￗￇ�?\r\n" + 
				"									                             ￗￇￇﾧￚﾡￎￇ�?\r\n" + 
				"									                        ￗￕￇﾯￚￚￚￚￚￚￚﾡￇￇ�?\r\n" + 
				"									                    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									                ￗￇￎﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇ�?\r\n" + 
				"									            ￗￕￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾡￎￇ�?\r\n" + 
				"									       ￛￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾻￇￇ�?\r\n" + 
				"									    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									ￛￇￇￗￗￗￗￗￗￗￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￗￗￗￗￗￗￇￇ�?\r\n" + 
				"									             ￇￇￚￚￚￚￚￗￇￇￇￇￇￇￇￇￇￇￇￇￇￗￚￚￚￚￚￚￇￂ\r\n" +  
				"									             ￇￇￚￚￚￚￛￇￇￚￚￚￚￚￚￚￚￚￚￚￇￇￇￚￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￚￚￚￇￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￗￗￕￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￗￗￗￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇﾫￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾫￇￇￇￂￇￋ\r\n" +  
				"									             ￇￇￇￇￗￚￚￇￇￇￇￋￚￚￚￚￚￛￇￇￇￇￗￚￚￇￇﾨￇￋ\r\n" +  
				"									             ￇￇￚￇￇￇￇￇￎￎￎￎￎￎￎￎￎￎￎￎￎￇￇￇￇￇￋￚￇￋ\r\n" + 
				"									             ￇￇￚￇￇￇￇￋￚￚￚￚￚￚￚￚￚￚￚￚￚￛￇￇￇￇﾧￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾨ");
		System.out.println("");
		System.out.print("											");
		
		
	}
	public void menub() {
		System.out.println("");
		System.out.println("");
		System.out.println("							  $$$$$$$\\                                $$\\");
		System.out.println("							  $$  __$$\\                               \\__|");                     
		System.out.println("							  $$ |  $$ |           $$$$$$\\  $$\\       $$\\            $$$$$$\\");                    
		System.out.println("							  $$$$$$$\\            $$  __$$\\ $$ |      $$ |          $$  __$$\\");  
		System.out.println("							  $$  __$$\\  $$$$$$\\  $$ /  $$ |$$ |  $$\\ $$ |$$$$$$$\\  $$ /  $$ |"); 
		System.out.println("							  $$ |  $$ |$$  __$$\\ $$ |  $$ |$$ | $$  |$$ |$$  __$$\\ $$ |  $$ |");
		System.out.println("							  $$$$$$$  |$$ /  $$ |\\$$$$$$  |$$$$$$  / $$ |$$ |  $$ |\\$$$$$$$ |");
		System.out.println("							  \\_______/ $$ |  $$ | \\______/ $$  _$$<  \\__|$$ |  $$ | \\____$$ |");
		System.out.println("							            \\$$$$$$  |          $$ | \\$$\\     $$ |  $$ |$$\\   $$ |");
		System.out.println("							             \\______/           \\__|  \\__|    \\__|  \\__| \\$$$$$$ |");
		System.out.println("							                                                          \\_____/");
		System.out.println("");
		System.out.println("");	
		System.out.println("");

		System.out.println("									1. ?��?��?���?		2. ?��?��?��?��\n");
		System.out.println("									3. ?��?��?��?��		4. ?�� ?��?��?��?��\n");
		System.out.println("									5. 취소");
		System.out.println("");

		System.out.println(
				"									                                  ￗￇ�?\r\n" + 
				"									                             ￗￇￇﾧￚﾡￎￇ�?\r\n" + 
				"									                        ￗￕￇﾯￚￚￚￚￚￚￚﾡￇￇ�?\r\n" + 
				"									                    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									                ￗￇￎﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇ�?\r\n" + 
				"									            ￗￕￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾡￎￇ�?\r\n" + 
				"									       ￛￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾻￇￇ�?\r\n" + 
				"									    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									ￛￇￇￗￗￗￗￗￗￗￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￗￗￗￗￗￗￇￇ�?\r\n" + 
				"									             ￇￇￚￚￚￚￚￗￇￇￇￇￇￇￇￇￇￇￇￇￇￗￚￚￚￚￚￚￇￂ\r\n" +  
				"									             ￇￇￚￚￚￚￛￇￇￚￚￚￚￚￚￚￚￚￚￚￇￇￇￚￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￚￚￚￇￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￗￗￕￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￗￗￗￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇﾫￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾫￇￇￇￂￇￋ\r\n" +  
				"									             ￇￇￇￇￗￚￚￇￇￇￇￋￚￚￚￚￚￛￇￇￇￇￗￚￚￇￇﾨￇￋ\r\n" +  
				"									             ￇￇￚￇￇￇￇￇￎￎￎￎￎￎￎￎￎￎￎￎￎￇￇￇￇￇￋￚￇￋ\r\n" + 
				"									             ￇￇￚￇￇￇￇￋￚￚￚￚￚￚￚￚￚￚￚￚￚￛￇￇￇￇﾧￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾨ");
		System.out.println("");
		System.out.print("											");
		
		
	}
	public void menuc() {
		System.out.println("");
		System.out.println("");
		System.out.println("							                                $$\\");
		System.out.println("							                                $$ |");
		System.out.println("							  $$$$$$$\\   $$$$$$\\            $$ |  $$\\ $$\\ $$$$$$$\\");
		System.out.println("							  $$  __$$\\ $$  __$$\\           $$ | $$  |\\__|$$  __$$\\");
		System.out.println("							  $$ |  $$ |$$ /  $$ | $$$$$$\\  $$$$$$  / $$\\ $$ |  $$ | $$$$$$\\");
		System.out.println("							  $$$$$$$\\  $$ |  $$ |$$  __$$\\ $$  _$$<  $$ |$$ |  $$ |$$  __$$\\");
		System.out.println("							  $$  __$$\\ \\$$$$$$  |$$ /  $$ |$$ | \\$$\\ $$ |$$ |  $$ |$$ /  $$ |");
		System.out.println("							  $$ |  $$ | \\______/ $$ |  $$ |\\__|  \\__|$$ |\\__|  \\__|$$ |  $$ |");
		System.out.println("							  $$$$$$$  |          \\$$$$$$  |          $$ |          \\$$$$$$$ |");
		System.out.println("							  \\_______/            \\______/           \\__|           \\____$$ |");
		System.out.println("							                                                        $$\\   $$ |");
		System.out.println("							                                                         \\$$$$$$ |");
		System.out.println("							                                                          \\_____/");
		System.out.println("");

		
		System.out.println("									1. ?��?��?���?		2. ?��?��?��?��\n");
		System.out.println("									3. ?��?��?��?��		4. ?�� ?��?��?��?��\n");
		System.out.println("									5. 취소");
		System.out.println("");

		System.out.println(
				"									                                  ￗￇ�?\r\n" + 
				"									                             ￗￇￇﾧￚﾡￎￇ�?\r\n" + 
				"									                        ￗￕￇﾯￚￚￚￚￚￚￚﾡￇￇ�?\r\n" + 
				"									                    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									                ￗￇￎﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇ�?\r\n" + 
				"									            ￗￕￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾡￎￇ�?\r\n" + 
				"									       ￛￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾻￇￇ�?\r\n" + 
				"									    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									ￛￇￇￗￗￗￗￗￗￗￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￗￗￗￗￗￗￇￇ�?\r\n" + 
				"									             ￇￇￚￚￚￚￚￗￇￇￇￇￇￇￇￇￇￇￇￇￇￗￚￚￚￚￚￚￇￂ\r\n" +  
				"									             ￇￇￚￚￚￚￛￇￇￚￚￚￚￚￚￚￚￚￚￚￇￇￇￚￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￚￚￚￇￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￗￗￕￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￗￗￗￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇﾫￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾫￇￇￇￂￇￋ\r\n" +  
				"									             ￇￇￇￇￗￚￚￇￇￇￇￋￚￚￚￚￚￛￇￇￇￇￗￚￚￇￇﾨￇￋ\r\n" +  
				"									             ￇￇￚￇￇￇￇￇￎￎￎￎￎￎￎￎￎￎￎￎￎￇￇￇￇￇￋￚￇￋ\r\n" + 
				"									             ￇￇￚￇￇￇￇￋￚￚￚￚￚￚￚￚￚￚￚￚￚￛￇￇￇￇﾧￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾨ");
		System.out.println("");
		System.out.print("											");
	}

	public void parkLayout() {
		
		System.out.println();
		System.out.println("								?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��");
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[0],pp[0],pp[0],pp[1],pp[1],pp[1],pp[2],pp[2],pp[2],pp[3],pp[3],pp[3],pp[4],pp[4],pp[4]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[0],pp[0],pp[0],pp[1],pp[1],pp[1],pp[2],pp[2],pp[2],pp[3],pp[3],pp[3],pp[4],pp[4],pp[4]);
		System.out.printf("								?�� %s01%s ?�� %s02%s ?�� %s03%s ?�� %s04%s ?�� %s05%s ?��\n",pp[0],pp[0],pp[1],pp[1],pp[2],pp[2],pp[3],pp[3],pp[4],pp[4]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[0],pp[0],pp[0],pp[1],pp[1],pp[1],pp[2],pp[2],pp[2],pp[3],pp[3],pp[3],pp[4],pp[4],pp[4]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[0],pp[0],pp[0],pp[1],pp[1],pp[1],pp[2],pp[2],pp[2],pp[3],pp[3],pp[3],pp[4],pp[4],pp[4]);
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[5],pp[5],pp[5],pp[6],pp[6],pp[6],pp[7],pp[7],pp[7],pp[8],pp[8],pp[8],pp[9],pp[9],pp[9]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[5],pp[5],pp[5],pp[6],pp[6],pp[6],pp[7],pp[7],pp[7],pp[8],pp[8],pp[8],pp[9],pp[9],pp[9]);
		System.out.printf("								?�� %s06%s ?�� %s07%s ?�� %s08%s ?�� %s09%s ?�� %s10%s ?��\n",pp[5],pp[5],pp[6],pp[6],pp[7],pp[7],pp[8],pp[8],pp[9],pp[9]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[5],pp[5],pp[5],pp[6],pp[6],pp[6],pp[7],pp[7],pp[7],pp[8],pp[8],pp[8],pp[9],pp[9],pp[9]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[5],pp[5],pp[5],pp[6],pp[6],pp[6],pp[7],pp[7],pp[7],pp[8],pp[8],pp[8],pp[9],pp[9],pp[9]);
		System.out.println("								?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��");
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[10],pp[10],pp[10],pp[11],pp[11],pp[11],pp[12],pp[12],pp[12],pp[13],pp[13],pp[13],pp[14],pp[14],pp[14]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[10],pp[10],pp[10],pp[11],pp[11],pp[11],pp[12],pp[12],pp[12],pp[13],pp[13],pp[13],pp[14],pp[14],pp[14]);
		System.out.printf("								?�� %s11%s ?�� %s12%s ?�� %s13%s ?�� %s14%s ?�� %s15%s ?��\n",pp[10],pp[10],pp[11],pp[11],pp[12],pp[12],pp[13],pp[13],pp[14],pp[14]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[10],pp[10],pp[10],pp[11],pp[11],pp[11],pp[12],pp[12],pp[12],pp[13],pp[13],pp[13],pp[14],pp[14],pp[14]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[10],pp[10],pp[10],pp[11],pp[11],pp[11],pp[12],pp[12],pp[12],pp[13],pp[13],pp[13],pp[14],pp[14],pp[14]);
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.println();
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[15],pp[15],pp[15],pp[16],pp[16],pp[16],pp[17],pp[17],pp[17],pp[18],pp[18],pp[18],pp[19],pp[19],pp[19]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[15],pp[15],pp[15],pp[16],pp[16],pp[16],pp[17],pp[17],pp[17],pp[18],pp[18],pp[18],pp[19],pp[19],pp[19]);
		System.out.printf("								?�� %s16%s ?�� %s17%s ?�� %s18%s ?�� %s19%s ?�� %s20%s ?��\n",pp[15],pp[15],pp[16],pp[16],pp[17],pp[17],pp[18],pp[18],pp[19],pp[19]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[15],pp[15],pp[15],pp[16],pp[16],pp[16],pp[17],pp[17],pp[17],pp[18],pp[18],pp[18],pp[19],pp[19],pp[19]);
		System.out.printf("								?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?�� %s%s%s ?��\n",pp[15],pp[15],pp[15],pp[16],pp[16],pp[16],pp[17],pp[17],pp[17],pp[18],pp[18],pp[18],pp[19],pp[19],pp[19]);
		System.out.println("								?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��?��");			
		System.out.println();	
		System.out.println();
	}	

	public void time() {
		System.out.println("\n\n\n\n\n\n");
		System.out.println("									00:00	01:00	02:00	03:00	04:00");
		System.out.println();
		System.out.println("									05:00	06:00	07:00	08:00	09:00");
		System.out.println();
		System.out.println("									10:00	11:00	12:00	13:00	14:00");
		System.out.println();
		System.out.println("									15:00	16:00	17:00	18:00	19:00");
		System.out.println();
		System.out.println("									20:00	21:00	22:00	23:00	24:00");
		System.out.println("\n\n\n\n");
	}
	
	public void caroom() {
		System.out.println(
				"									                                  ￗￇ�?\r\n" + 
				"									                             ￗￇￇﾧￚﾡￎￇ�?\r\n" + 
				"									                        ￗￕￇﾯￚￚￚￚￚￚￚﾡￇￇ�?\r\n" + 
				"									                    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									                ￗￇￎﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇ�?\r\n" + 
				"									            ￗￕￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾡￎￇ�?\r\n" + 
				"									       ￛￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚﾻￇￇ�?\r\n" + 
				"									    ￗￇￎￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￗ\r\n" + 
				"									ￛￇￇￗￗￗￗￗￗￗￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￚￗￗￗￗￗￗￇￇ�?\r\n" + 
				"									             ￇￇￚￚￚￚￚￗￇￇￇￇￇￇￇￇￇￇￇￇￇￗￚￚￚￚￚￚￇￂ\r\n" +  
				"									             ￇￇￚￚￚￚￛￇￇￚￚￚￚￚￚￚￚￚￚￚￇￇￇￚￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￚￚￚￇￇﾧￚￚￚￚￚￚￚￚￚￚￚￚￇￇￗￚￚￚￚￇￋ\r\n" + 
				"									             ￇￇￚￗￗￕￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￗￗￗￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇﾫￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾫￇￇￇￂￇￋ\r\n" +  
				"									             ￇￇￇￇￗￚￚￇￇￇￇￋￚￚￚￚￚￛￇￇￇￇￗￚￚￇￇﾨￇￋ\r\n" +  
				"									             ￇￇￚￇￇￇￇￇￎￎￎￎￎￎￎￎￎￎￎￎￎￇￇￇￇￇￋￚￇￋ\r\n" + 
				"									             ￇￇￚￇￇￇￇￋￚￚￚￚￚￚￚￚￚￚￚￚￚￛￇￇￇￇﾧￚￇￋ\r\n" + 
				"									             ￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇￇﾨ");

	}
	
	@Override
	public void run() {
		
		try {
			for(int i=0;i<7;i++) {
				menua();
				sleep(100);	
				System.out.println("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
				
				menub();	
				sleep(100);
				System.out.println("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
				
				menuc();
				sleep(100);	
				System.out.println("\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n");
			}			
			
		} catch (Exception e) {
			System.out.println(e.toString());
		}
	}
	
		
}
